import type { IconSvgProps } from './types'

/**
 * Music Icon Component
 * آیکون موزیک از طرح Figma
 */
export const HeaderIcon = ({
  size = 24,
  className = '',
  color = 'currentColor',
  ...svgProps
}: IconSvgProps) => {
  return (
    <div
      className={`relative ${className}`}
      style={{ width: size, height: size }}>
      <div className="absolute inset-[1.87%_8.69%_1.87%_9.49%]">
        <svg
          width="20"
          height="24"
          viewBox="0 0 20 24"
          fill="none"
          {...svgProps}
          xmlns="http://www.w3.org/2000/svg">
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M10.7299 19.9201C10.5503 22.2434 9.2908 23.1017 9.2908 23.1017C9.2908 23.1017 9.2003 20.7566 6.41122 19.8261C3.62262 18.8961 0.383853 18.1532 0.0242021 15.6423C-0.335924 13.131 3.44207 11.551 3.44207 11.551C3.44207 11.551 -0.335924 9.97067 0.0242021 7.45978C0.383853 4.94841 3.62262 4.20499 6.41122 3.27547C9.2003 2.34595 9.2908 0 9.2908 0C9.2908 0 10.5503 0.857641 10.7299 3.18242C10.9094 5.5077 9.64998 6.80892 9.64998 6.80892C9.64998 6.80892 10.6409 6.15757 12.349 6.15757C14.0587 6.15757 15.5874 7.08807 16.6677 8.70734C17.7472 10.3286 19.6364 11.551 19.6364 11.551C19.6364 11.551 17.7472 12.7735 16.6677 14.3942C15.5874 16.0146 14.0587 16.944 12.349 16.944C10.6409 16.944 9.64998 16.2926 9.64998 16.2926C9.64998 16.2926 10.9094 17.5954 10.7299 19.9201Z"
            fill={color}
          />
        </svg>
      </div>
    </div>
  )
}
